### Import Data From Excel
- Use pandas package to import Excel spreadsheets
- Import any given sheet of your loaded work book file as a DataFrame, by specifying either the sheet's name or its index.
- It allows to skip rows, rename columns and select only particular columns.

### 1.1 change current working Directory

In [1]:
import os

In [2]:
os.getcwd()

'C:\\Users\\LENOVO\\Desktop\\rrItech\\b2019aug10\\level3(data analyst)'

In [4]:
os.chdir("E:\\D-drive\\DS\\data\\01 DS ML DL NLP and AI With Python Lab Copy\\02.LabData")

In [5]:
os.getcwd()

'E:\\D-drive\\DS\\data\\01 DS ML DL NLP and AI With Python Lab Copy\\02.LabData'

### 1.2 Create DataFrame from Excel

In [12]:
pd.read_excel?
Signature: pd.read_excel(io, sheet_name=0, header=0, names=None, index_col=None, usecols=None, squeeze=False,
                         dtype=None, engine=None, converters=None, true_values=None, false_values=None, 
                         skiprows=None, nrows=None, na_values=None, parse_dates=False, date_parser=None, 
                         thousands=None, comment=None, skipfooter=0, convert_float=True, **kwds)
Docstring: Read an Excel table into a pandas DataFrame

In [29]:
import pandas as pd

df = pd.read_excel("ScottData.xlsx")
df.head()

   EMPNO   ENAME       JOB     MGR   HIREDATE   SAL    COMM  DEPTNO
0   7369   SMITH     CLERK  7902.0 1980-12-17   800     NaN      20
1   7900   JAMES     CLERK  7698.0 1981-12-03   950     NaN      30
2   7876   ADAMS     CLERK  7788.0 1987-05-23  1100     NaN      20
3   7521    WARD  SALESMAN  7698.0 1981-02-22  1250   500.0      30
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250  1400.0      30

In [30]:
df1 = pd.read_excel("ScottData.xlsx", sheet_name=1)
df1

   DEPTNO       DNAME       LOC
0      10  ACCOUNTING  NEW YORK
1      20    RESEARCH    DALLAS
2      30       SALES   CHICAGO
3      40  OPERATIONS    BOSTON

In [31]:
type(df1)

pandas.core.frame.DataFrame

In [32]:
#if we want to convert dataframe into 2d array
df1.values

array([[10, 'ACCOUNTING', 'NEW YORK'],
       [20, 'RESEARCH', 'DALLAS'],
       [30, 'SALES', 'CHICAGO'],
       [40, 'OPERATIONS', 'BOSTON']], dtype=object)

In [33]:
type(df1.values)

numpy.ndarray

In [34]:
df1.values.ndim

2

### 1.3 write DataFrame data into Excel

In [49]:
df.head()

   EMPNO   ENAME       JOB     MGR   HIREDATE   SAL    COMM  DEPTNO
0   7369   SMITH     CLERK  7902.0 1980-12-17   800     NaN      20
1   7900   JAMES     CLERK  7698.0 1981-12-03   950     NaN      30
2   7876   ADAMS     CLERK  7788.0 1987-05-23  1100     NaN      20
3   7521    WARD  SALESMAN  7698.0 1981-02-22  1250   500.0      30
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250  1400.0      30

In [50]:
# convert the dataframe to an Xlsx Writer Excel object
df.to_excel("test.xlsx", sheet_name="Sheet1")
# writer.save() #close the pandas Excel writer and output the excel file.

### Example2:

In [58]:
import pandas as pd
# Create a Pandas dataframe from the data.
df = pd.DataFrame({'Data': [10, 20, 30, 20, 15, 30, 45]})
df # verfiy data frame data

   Data
0    10
1    20
2    30
3    20
4    15
5    30
6    45

In [59]:
# Create a Pandas Excel writer using XlsxWriter as the engine.
writer = pd.ExcelWriter('pandas_simple_13feb2019.xlsx',
                        engine='xlsxwriter')

In [60]:
type(writer)

pandas.io.excel._XlsxWriter

In [62]:
# Convert the dataframe to an XlsxWriter Excel object.
df.to_excel(writer, sheet_name='Sheet1')
writer.save() # Close the Pandas Excel writer and output the Excel file.

### Note: This is used in predective analysis

In [63]:
s=pd.Series([10,20,30])
type(s)

pandas.core.series.Series

In [64]:
s.to_excel("test1.xlsx",sheet_name="Sheet2")

### 1.4 Conditional Formatting

[Excel Reading and Writing](https://xlsxwriter.readthedocs.io/examples.html)

In [68]:
import xlsxwriter

workbook = xlsxwriter.Workbook('hello_world.xlsx')
worksheet = workbook.add_worksheet()

worksheet.write('A1', 'Hello world')

workbook.close()

In [67]:
import xlsxwriter

workbook = xlsxwriter.Workbook('conditional_format.xlsx')
worksheet1 = workbook.add_worksheet("Test_Sheet1")
worksheet2 = workbook.add_worksheet("Test_Sheet2")

# Add a format. Light red fill with dark red text.
format1 = workbook.add_format({'bg_color': '#FFC7CE',
                               'font_color': '#9C0006'})

# Add a format. Green fill with dark green text.
format2 = workbook.add_format({'bg_color': '#C6EFCE',
                               'font_color': '#006100'})

# Some sample data to run the conditional formatting against.
data = [
    [34, 72, 38, 30, 75, 48, 75, 66, 84, 86],
    [6, 24, 1, 84, 54, 62, 60, 3, 26, 59],
    [28, 79, 97, 13, 85, 93, 93, 22, 5, 14],
    [27, 71, 40, 17, 18, 79, 90, 93, 29, 47],
    [88, 25, 33, 23, 67, 1, 59, 79, 47, 36],
    [24, 100, 20, 88, 29, 33, 38, 54, 54, 88],
    [6, 57, 88, 28, 10, 26, 37, 7, 41, 48],
    [52, 78, 1, 96, 26, 45, 47, 33, 96, 36],
    [60, 54, 81, 66, 81, 90, 80, 93, 12, 55],
    [70, 5, 46, 14, 71, 19, 66, 36, 41, 21],
]


###############################################################################
#
# Example 1.
#
caption = ('Cells with values >= 50 are in light red. '
           'Values < 50 are in light green.')

# Write the data.
worksheet1.write('A1', caption)

for row, row_data in enumerate(data):
    worksheet1.write_row(row + 2, 1, row_data)

# Write a conditional format over a range.
worksheet1.conditional_format('B3:K12', {'type': 'cell',
                                         'criteria': '>=',
                                         'value': 50,
                                         'format': format1})

# Write another conditional format over the same range.
worksheet1.conditional_format('B3:K12', {'type': 'cell',
                                         'criteria': '<',
                                         'value': 50,
                                         'format': format2})

workbook.close()